run/papers/consistentFSI/cirleInCircle/fsiBody3Mesh4_BDF3/base/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyPatch       airfoil;
fsiRelaxation   0.7;
minIter                 3;
maxIter                 100;
minResidual     1e-8;
couplingScheme  Aitken;
writeToFile     true;

forces
{
        patches (inside);
        pName p;          //pressure
        Uname U;          //velocity
        rhoName rhoInf;
        rhoInf 1;
        //liftDir (0 1 0);   //Direction of the lift coefficient
        //dragDir (1 0 0);   //Direction of the drag coefficient
}
// ************************************************************************* //
