run/papers/consistentFSI/cirleInCircle/fsiBody3Mesh4_BDF3/base/system/fvSchemes
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object fvSchemes;
}

ddtSchemes
{
  default bdf3;
  ddt(U) bdf3;
}

gradSchemes
{
  default Gauss linear ;
}

divSchemes
{
  default no;
  div(phi,U) Gauss linear ;
  div((nuEff*dev(grad(U).T()))) Gauss linear ;
}

laplacianSchemes
{
  default Gauss linear corrected ;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

fluxRequired
{
  default no;
  pcorr /* empty */ ;
  p /* empty */ ;
} 	// ************************************************************************* //

